
### :robot: Terraform Report
---
##### Plan: `1` to add, `0` to change, `0` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.argocd_app_repositories[0] will be created
  + resource "helm_release" "argocd_app_repositories" {
      + atomic                     = false
      + chart                      = "argocd-apps"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd-app-repositories"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                applications:
                  harbor:
                    namespace: argocd
                    project: repositories
                    finalizers:
                    - resources-finalizer.argocd.argoproj.io
                
                    sources:
                    - chart: harbor
                      repoURL: https://helm.goharbor.io
                      targetRevision: 1.15.1
                      helm:
                        releaseName: harbor
                        parameters:
                          - name: metrics.enabled
                            value: "true"
                
                    destination:
                      server: https://kubernetes.default.svc
                      namespace: repositories
                
                    syncPolicy:
                      automated:
                        prune: true
                        selfHeal: true
                      syncOptions:
                      - CreateNamespace=true
                
                projects:
                  repositories:
                    namespace: argocd
                    finalizers:
                    - resources-finalizer.argocd.argoproj.io
                    description: Project Repositories for apps in cluster
                    sourceRepos:
                    - '*'
                    destinations:
                    - namespace: repositories
                      server: https://kubernetes.default.svc
                    clusterResourceWhitelist:
                    - group: '*'
                      kind: '*'
            EOT,
        ]
      + verify                     = false
      + version                    = "2.0.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#11645559514`](https://github.com/innovats-hub/system-apps-aks/actions/runs/11645559514) - commit c7b34eb5c7bc120a03fcecba0934314acf669486
